/************************************************************************
 * Интерфейс: SolveInterface
 * Дата: 13.11.2025
 * Разработчик: Попов Иван
 * ======================================================================
 * Интерфейс для поиска решения задачи о миссионерах и людоедах
 ************************************************************************/

package solver;
import model.Situation;
import java.util.List;

public interface SolveInterface {
    /**
     * Метод поиска решения
     * @param initialState — начально состояние игрового поля
     * @return — список ходов для прохождения игры
     */
    List<String> searchSolution(Situation initialState);
}
