/************************************************************************
 * Перечисление: SolveType
 * Дата: 13.1.2025
 * Разработчик: Попов Иван
 * ======================================================================
 * Перечисление методов для поиска решения
 ************************************************************************/

package solver;

public enum SolveType {
    BFS,        // Поиск в ширину
    DFS,        // Поиск в глубину
    GRADIENT,   // Метод наискорейшего подъема (поиск по градиенту) смешанный с перебором в глубину
    ASTAR,      // Метод А стар
    BRANCH_AND_BOUND, // Метод ветвей и границ
    UNIFORM_COST //Метод равных цен
}
